Table of Contents
 Class ColumnData
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Column data base
public abstract class ColumnData
Inheritance
object
ColumnData
Derived
ColumnDataEc2
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ColumnData()
Constructor
public ColumnData()
Properties
 CalculateY
Gets an indication, whether imperfections and second order have to be performed perpendicular to the y axis.
public bool CalculateY { get; set; }
Property Value
bool
 CalculateZ
Gets an indication, whether imperfections and second order have to be performed perpendicular to the z axis.
public bool CalculateZ { get; set; }
Property Value
bool
 EffectiveLength
Gets or sets type of input effective length
public InputValue EffectiveLength { get; set; }
Property Value
InputValue
 FemL0Y
effective length calculated in FEM for Y direction
public double FemL0Y { get; set; }
Property Value
double
 FemL0Z
effective length calculated in FEM for Z direction
public double FemL0Z { get; set; }
Property Value
double
 FemLenghtFromFlexibleSupport
true if FEM length were calculated from flexible supports
public bool FemLenghtFromFlexibleSupport { get; set; }
Property Value
bool
 ImperfectionDirection
Gets or sets the direction of imperfection.
public ImperfectionDirection ImperfectionDirection { get; set; }
Property Value
ImperfectionDirection
 ImperfectionsInput
Indicates, whether use user values or calculate effect of imperfections.
public InputValue ImperfectionsInput { get; set; }
Property Value
InputValue
 L
Gets or sets the system length of column.
public double L { get; set; }
Property Value
double
 L0Y
Gets or sets the user defined effective length of column for Y direction. If is not defined, the must be valid support data.
public double L0Y { get; set; }
Property Value
double
 L0Z
Gets or sets the user defined effective length of column for Z direction.
public double L0Z { get; set; }
Property Value
double
 SecondOrderEffectInput
Indicates, whether use user values or calculate 2'nd order effect.
public InputValue SecondOrderEffectInput { get; set; }
Property Value
InputValue
 SupportBottomY
Gets or sets the end support. Not necessary if effective lengths are defined.
public SupportType SupportBottomY { get; set; }
Property Value
SupportType
 SupportBottomZ
Gets or sets the end support. Not necessary if effective lengths are defined.
public SupportType SupportBottomZ { get; set; }
Property Value
SupportType
 SupportTopY
Gets or sets the end support. Not necessary if effective lengths are defined.
public SupportType SupportTopY { get; set; }
Property Value
SupportType
 SupportTopZ
Gets or sets the end support. Not necessary if effective lengths are defined.
public SupportType SupportTopZ { get; set; }
Property Value
SupportType
 Edit this page